{
  "puzzleOfTheDayId": "blue-lightning",
  "puzzles": [
    {
      "id": "blue-lightning",
      "title": "Based Blue Lightning",
      "author": "WEBthe3rd",
      "sudokupadUrl": "https://sudokupad.app/r5fv1ebr5n",
      "difficulty": "medium",
      "dateAdded": "2025-01-03",
      "notes": [
        "This one is fairly approachable, but still tricky, especially if you're new to region sum lines. Here is a quick explaination of region sum lines:",
        "Each time a region sum line crosses from one 3x3 box to another, it splits the digits in the two boxes into segments of the same sum.",
        "For example, the long blue line at the top of the puzzle is split into the following six segments:",
        "{r3c3, r3c2, r2c3}, {r1c4, r1c5, r1c6}, {r1c7, r1c8, r2c7}, {r3c6}, {r3c7, r3c8}, {r4c7}",
        "Note that two of these segments just contain a single cell, i.e., r3c6 and r4c7. This implies two things:",
        "1. These two cells must contain the same digit.",
        "2. The longer segments each cannot sum to more than 9, because otherwise the two single-cell segments would need to contain digits greater than 9, which is impossible.",
        "Note also that the minimum sum of any 3-cell segment is 6, i.e., the sum of the digits 1, 2, and 3. This implies that r3c6 and r4c7 cannot be lower than 6, so they must be from the set {6, 7, 8, 9}."
      ]
    },
    {
      "id": "almost-times",
      "title": "Almost Time(s)",
      "author": "WEBthe3rd",
      "sudokupadUrl": "https://sudokupad.app/so2l3wtiwm",
      "difficulty": "easy",
      "dateAdded": "2025-01-04",
      "notes": [
        "I'll be sticking to posting 6x6 puzzles for a bit, since they're quicker and more approachable, which is probably better for a daily puzzle in your social feed.",
        "This one is a follow-up to the previous puzzle, sticking with the same theme of region sum lines.",
        "Remember, the smallest possible sum of any 3-cell segment is 6, i.e., the sum of the digits 1, 2, and 3."
      ]
    }
  ]
}
